# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\My_Files\College_Documents\AMA EOS\EOS\LAB\LAB_2_Submission\Json Parser\code\w06_criticalRegion.cydsn\w06_criticalRegion.cyprj
# Date: Wed, 28 Feb 2024 13:02:55 GMT
#set_units -time ns
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 13.888888888888888 -waveform {0 6.94444444444444} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 13.888888888888888 -waveform {0 6.94444444444444} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {TFT_SPI_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {PWM_Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 9 19} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {PWM_Clock_TFT} -source [get_pins {ClockBlock/clk_sync}] -edges {1 15 29} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {UART_LOG_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 79 157} [list [get_pins {ClockBlock/dclk_glb_3}]]


# Component constraints for C:\My_Files\College_Documents\AMA EOS\EOS\LAB\LAB_2_Submission\Json Parser\code\w06_criticalRegion.cydsn\TopDesign\TopDesign.cysch
# Project: C:\My_Files\College_Documents\AMA EOS\EOS\LAB\LAB_2_Submission\Json Parser\code\w06_criticalRegion.cydsn\w06_criticalRegion.cyprj
# Date: Wed, 28 Feb 2024 13:02:50 GMT
